//1. Создать пустой проект в IntelliJ IDEA и прописать метод main();
package lesson1;

import java.io.Serializable;

public class Lesson1 {
    public static void main(String[] args) {

//2. Создать переменные всех пройденных типов данных, и инициализировать их значения;
//            byte v = -120;
//            short s1=94;
//            int i1=2018;
//            long l1=5642224645363565546L;
//            float pi1=3.14f;
//            double pi2=3.141592653589793;
//            char c1='A';
//            boolean i = false;


//3. Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,где a, b, c, d – входные параметры этого метода;

//        System.out.println(calcEm(2,3,4,5));
//    }
//        static int calcEm(int a, int b, int c, int d) {
//            int i;
//            i = (a * (b + (c / d)));
//            return i;
//        }

// 4. Написать метод, принимающий на вход два числа, и проверяющий что их сумма лежит в пределах от 10 до 20(включительно), если да – вернуть true, в противном случае – false;

//            System.out.println(getCalc(2,5));
//        }
//        static boolean getCalc(int a, int b) {
//            int i = a + b;
//            if (i >= 10 && i <= 20) {
//                return true;
//            } else {
//                return false;
//            }
//        }

//5. Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль положительное ли число передали, или отрицательное; Замечание: ноль считаем положительным числом.

//          pozOrNeg(0);
//            }
//         static void pozOrNeg(int i) {
//        if (i >= 0) {
//            System.out.println("Положительное");
//        } else {
//            System.out.println("Отрицательное");
//        }
//    }

////6. Написать метод, которому в качестве параметра передается целое число, метод должен вернуть true, если число отрицательное;

//        System.out.println (pozitivMe(-2));
//            }
//        static boolean pozitivMe (int i) {
//            if (i < 0){
//                return true;
//            }
//            return false;
//        }

//7. Написать метод, которому в качестве параметра передается строка, обозначающая имя, метод должен вывести в консоль сообщение «Привет, указанное_имя!»;

//        MsgMe("Evgeniy");
//    }
//        static void MsgMe (String name) {
//            System.out.println("Привет, " + name + " !");
//        }

// 8. * Написать метод, который определяет является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.

//        System.out.println(yearVip(1600));
//    }
//            static Serializable yearVip (int y) {
//                if (y % 400 == 0 || (y % 4 == 0 && y % 100 != 0)) {
//                    return ("Высокосный");
//                } else {
//                    return ("Невысокосный");
//                }
//            }
}


